public/writing/poetry/favourites/to-the-unknown-journeyman.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../writing.html">Writing</a> &gt; <a href="../poetry.html">Poetry</a> &gt; <a href="favourites.html">Collected Favourites</a> &gt;
</p>

<div id="outline-container-orgb2dd784" class="outline-2">
<h2 id="orgb2dd784">To the unknown journeyman</h2>
<div class="outline-text-2" id="text-orgb2dd784">
<blockquote>
<p>
To the unknown journeyman
I promise to show courage
in upholding my vows
</p>

<p>
What is an adventure
if not the commitment
to keep going?
</p>
</blockquote>

<p>
By Protesilaos Stavrou, 2025-08-11, <a href="https://protesilaos.com/poems/2025-08-11-unknown-journeyman/">original link</a>.
</p>
</div>

<div id="outline-container-orgb0877a7" class="outline-3">
<h3 id="orgb0877a7">Comment</h3>
<div class="outline-text-3" id="text-orgb0877a7">
<p>
Truly beautiful and powerful words from Prot, as always. I feel
greatly moved by this poem.
</p>

<p>
From Wikipedia, a journeyman is "a worker, skilled in a given building
trade or craft, who has successfully completed an official
apprenticeship qualification.". He is someone that showed dedication
and fought through adversities to master his skill: someone can can be
looked up to. Yet there are many "unknown" journeymen, especially in
the world of programming, there are so many professionals that are
doing excellent and critical work but are greatly under-recognized and
underappreciated (maybe Prod is thinking of his condition, and the
one of other maintainers).
</p>

<p>
Someone that mastered their skills can motivate us into working harder
and harder. It surely does for me. He made a promise to himself, and
so do I, to never give up.
</p>

<p>
The second part of the poem explores this idea, and it words it
beautifully.
</p>

<p>
I find a deep stoic meaning in this poem, to keep going through
life nevertheless.
</p>

<hr />

<p>
Travel: <a href="favourites.html">Collected Favourites</a>, <a href="../../../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</div>
</body>
</html>
